{
  "basics": {
    "name": "Jiankun (David) Wei",
    "Jobs": "Student, AI Researcher",
    "image": "",
    "email": "jiankun.wei@mail.utoronto.ca",
    "phone": "(306) 201-9129",
    "url": "https://david-wei-01001.github.io/",
    "summary": "Dynamic, self-motivated professional with a robust foundation in Computer Science, complemented by a keen interest in Artificial Intelligence and Large Language Models. Boasts a track record of academic excellence, underscored by high university grades and a portfolio of diverse projects. Brings practical experience in software testing, including developing comprehensive test cases. Distinguished by exceptional communication abilities and a collaborative spirit. Eager to deepen expertise in AI through graduate studies, aiming to explore a broad spectrum of models and their applications.",
    "location": {
      "address": "120 Nassau Street",
      "postalCode": "M5T 1M7",
      "city": "Toronto",
      "countryCode": "CA",
      "region": "Ontario"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "david-wei-01001",
        "url": "https://github.com/david-wei-01001"
      },
      {
        "network": "LinkedIn",
        "username": "jiankunwei",
        "url": "https://www.linkedin.com/in/jiankunwei/"
      }
    ]
  },
  "skills": [
    {
      "name": "Soft Skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Self-motivation",
        "Creative Problem Solving",
        "Accountability",
        "Communication",
        "Teamwork",
        "Adaptability",
        "Presentation"
      ]
    },
    {
      "name": "Technical Skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "C",
        "C#",
        "Java",
        "R",
        "OpenAI API",
        "MatLab",
        "Pytorch",
        "TensorFlow",
        "NumPy",
        "Unity",
        "JavaScript",
        "React",
        "HTML5",
        "CSS3",
        "FireBase",
        "Linux/Unix"
      ]
    }
  ],
  "work": [
     {
      "name": "Department of Computer Science, University of Toronto",
      "position": "Researcher",
      "url": "https://medcvr.utm.utoronto.ca/",
      "startDate": "2024-05-01",
      "endDate": "PRESENT",
      "summary": "I conducted extensive research on various speculative decoding methods of LLM inference, including self-drafting vs. independent drafting, lossless vs. approximate decoding, and greedy decoding vs. speculative sampling. During this research, I explored and visualized speculative behavior by measuring metrics such as total generation time, latency, and correct speculation rate, and traced time taken and tokens generated for each iteration as potential side channels. Additionally, I developed and executed fingerprinting attacks and timing side-channel attacks using advanced machine learning techniques such as Random Forest, Bottleneck Network, and pretrained Transformers, yielding promising results. Through this process, I gained solid experience in shell programming and efficiently utilizing SLURM schedulers to load and run jobs on GPUs. I regularly prepared and presented detailed progress reports, demonstrating complex findings and advancements.",
       "highlights": ["Self-driving", "Creative Problem Solving", "Comunication", "Speculative Decoding", "Data Visualization", "Side Channel Attacks", "Fine-tuing LLMs"]
    },
    {
      "name": "MEDCVR Lab, University of Toronto",
      "position": "Robotics Researcher",
      "url": "https://medcvr.utm.utoronto.ca/",
      "startDate": "2024-01-01",
      "endDate": "2024-04-20",
      "summary": "I spearheaded the integration of LLMs as the lower-level controller and trajectory planner for robotics, ensuring fault tolerance by detecting and correcting failures midway. I designed LLM prompts and deployed LLM within Unity using C#, significantly enhanced real-time application performance. Additionally, I contributed to the LLMUnity package and led macOS testing, enhancing adoption and compatibility. I also established a seamless remote connection to the Google Vertex AI cloud platform within Unity which demonstrated innovative problem-solving. Furthermore, I regularly prepared and presented comprehensive weekly PowerPoint updates to highlight ongoing progress and key developments.",
      "highlights": ["Large Language Models", "Robotics", "Cloud Computing", "Unity", "C#", "Prompt Design", "HTTP Clients"]
    },
    {
      "name": "AIT Lab, ETH Zürich",
      "position": "Volunteer Researcher",
      "url": "https://ait.ethz.ch/",
      "startDate": "2023-07-01",
      "endDate": "2023-11-01",
      "summary": "I adopted Detectron2 and torchvision's FasterRCNN libraries for advanced object detection and computer vision projects. I was able to analyze and interpret source code to enhance problem-solving and development efficiency. I was responsible and efficient in managing GPU-accelerated server resources, ensuring fair use without compromising others' processes and maintaining optimal application performance. Additionally, I was a highly self-motivated team contributor, driven to achieve collective goals and advance project initiatives.",
      "highlights": ["Collaboration", "Object Detection", "Robotics", "CUDA", "Detectron2", "PyTorch", "TorchVision", "GPU-accelerated server"]
    },
    {
      "name": "Monk School of Global Affairs and Public Policy",
      "position": "Researcher",
      "url": "https://munkschool.utoronto.ca/",
      "startDate": "2021-09-10",
      "endDate": "2022-04-20",
      "summary": "I conducted research to identify threats in the Chinese real estate sector, such as capital chain stresses and landlord complaints, during the Chinese Real Estate Crisis. In this research, I used Python libraries NLTK and Jieba to process Chinese text and to perform sentiment analysis to highlight emerging risks. I utilized Excel for advanced data manipulation and Python for integrating and processing datasets. By scrutinizing annual reports and using financial websites like Qichacha and East Money, I gathered critical financial insights. Finally, I was dedicated and collaborative, ensuring project success and timely delivery of insights.",
      "highlights": ["Hardworking", "Sentiment Analysis", "Tokenization", "Annual Report"]
    },
    {
      "name": "Uken Games Inc.",
      "position": "QA Engineer",
      "url": "https://www.uken.com/",
      "startDate": "2023-05-08",
      "endDate": "2024-04-26",
      "summary": "Expert in developing and reviewing test cases, streamlining software testing in Unity with automation, and leveraging tools for enhanced testing communication and efficiency.",
      "highlights": ["Software Testing", "Communication", "Automated Testing", "Reading design documents", "Teamwork", "TestRail", "Bridge", "Kibana"]
    }
  ],"projects": [
    {
      "name": "LLM-Enhanced Robotics Manipulation",
      "summary": "I implemented adaptive control strategies in robotics by utilizing LLMs for image understanding, significantly enhancing real-time feedback and task execution efficiency. Additionally, I developed a trajectory planning algorithm which provided fault tolerance and operational flexibility by integrating LLMs into the robot's low-level control logic to enhance decision-making capabilities and autonomous error detection and adjustments.",
      "highlights": ["Large Lange Model", "Image Understanding", "Robotics", "Unity3D", "Decision Making", "MoveIt"],
      "startDate": "2024-01-01",
      "endDate": "2024-04-22",
      "url": "https://github.com/david-wei-01001/LLM-Robotics"
    },
    {
      "name": "Crypto Care",
      "summary": "I implemented the database for the CryptoCare project, including user registration, secure login authentication, real-time wallet balance updates, and comprehensive documentation of donation activities. I also contributed to the UI design for key components, including the complete and crucial dashboard elements, by creating a beautiful and comfortable appearance with smooth animations upon changes and clicks. During this project, I rapidly mastered JavaScript and React with no prior experience, demonstrating a strong capacity for learning and applying new technologies to deliver a sophisticated and functional application. Additionally, I collaborated with teammates to implement MetaMask Ethereum transactions and balance checks on the Sepolia testnet.",
      "highlights": ["React", "JavaScript", "HTML5", "CSS3", "Front End", "FireBase"],
      "startDate": "2024-04-19",
      "endDate": "2024-04-20",
      "url": "https://github.com/david-wei-01001/CryptoCare"
    },
    {
      "name": "Multi-Style Transfer",
      "summary": "I implemented multi-style transfer on photographs using both CycleGAN and Neural Style Transfer (NST) and then conducted a thorough comparison of these methodologies to showcase differences in style application through detailed visuals and performance benchmarks such as SSIM, FID, and Style Consistency. In this project, I demonstrated proficiency in using PyTorch and TensorFlow frameworks and also exhibited a deep understanding of the CycleGAN architecture.",
      "highlights": ["cycle GAN", "PyTorch", "TensorFlow", "Neural Networks", "Performance Analysis", "Computer Graphics"],
      "startDate": "2023-01-01",
      "endDate": "2023-04-31",
      "url": "https://github.com/david-wei-01001/CSC413-Project"
    },
    {
      "name": "Online Learning Community Software",
      "summary": "I engineered an online platform to foster a learning community for sharing educational materials, employing rigorous software development methodologies. In this project, I demonstrated good software development habits by writing clear and comprehensible spec documents, applying various design patterns to solve complex problems effectively, and implementing comprehensive unit testing to guarantee code quality. Additionally, I managed the project’s evolution with professional Git usage and detailed code documentation, facilitating smooth collaboration within the team and ensuring efficient progress tracking and code integration.",
      "highlights": ["Java", "Software Development", "Design Patterns", "Test Driven Design", "Unit Testing", "Communication"],
      "startDate": "2021-09-01",
      "endDate": "2021-12-20",
      "url": "https://github.com/CSC207-UofT/course-project-whatev er-you-want-1.git"
    }
  ],
  "education": [
    {
      "institution": "University of Toronto",
      "location": "Toronto, Canada",
      "url": "https://www.uzh.ch/",
      "area": "Computer Science",
      "studyType": "undergraduate",
      "startDate": "2020-09",
      "endDate": "PRESENT",
      "score": "3.99/4.00",
      "courses": ["Audited CSC2221: Theory of Distributed Computing", "Audited MAT344: Introduction to Combinatorics", "Attended TCURC (Trinity College Undergraduate Research Conference)", "Poster Presentiation in UGSRP Research Showcase"]
    }
  ],
  "awards": [
    {
      "title": "6T5 Scholarship for high academic achievement",
      "date": "2022-04-31",
      "awarder": "University of Toronto"
    },
    {
      "title": "Drew Thompson Scholarship for high academic achievement",
      "date": "2022-04-31",
      "awarder": "University of Toronto"
    },
    {
      "title": "Drew Thompson Scholarship for high academic achievement",
      "date": "2023-04-31",
      "awarder": "University of Toronto"
    },
    {
      "title": "Dean’s List Scholar in the Faculty of Art & Science",
      "date": "2024 Winter",
      "awarder": "University of Toronto"
    },
    {
      "title": "Dean’s List Scholar in the Faculty of Art & Science",
      "date": "2023 Winter",
      "awarder": "University of Toronto"
    },
    {
      "title": "Dean’s List Scholar in the Faculty of Art & Science",
      "date": "2022 Winter",
      "awarder": "University of Toronto"
    },
    {
      "title": "Dean’s List Scholar in the Faculty of Art & Science",
      "date": "2021 Summer",
      "awarder": "University of Toronto"
    }
  ],
  "languages": [
    {
      "language": "Mandarin",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "French",
      "fluency": "Beginner",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Meditation",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Reading Books",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Cooking",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Jogging",
      "icon": "fa-solid fa-tag"
    }
  ],
  "volunteer": [
    {
      "organization": "University of Toronto Buddha’s Light Club",
      "location": "Toronto, Canada",
      "position": "Executive Member",
      "url": "https://sop.utoronto.ca/group/university-of-toronto-buddhas-light-club/",
      "startDate": "2022-09-10",
      "endDate": "2023-04-20",
      "summary": "I strategically planned and coordinated club events, enhancing community engagement and member participation. I also designed and managed engaging content for social media platforms to promote club activities and increase online presence. Additionally, I participated in weekly Buddhist worship ceremonies, deepening my cultural understanding and personal practice.",
      "highlights": ["Leadership", "Organizational Skills", "Creative Communication", "Meditation", "Spiritual Growth"]
    }
  ]
}
